code-review/NRB_3471_3546/База_Было/DataProcessors/ФиксацияКорпоративныхДействийВСообщенияхКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ФиксацияКорпоративныхДействийВСообщенияхКД</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВремяЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВходящиеСообщения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПериодНомераСообщенияИсходного</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КД</Name>
							<Comment>(Карточка КД)</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.РаскрытиеСпискаВладельцев</v8:Type>
								<v8:Type>cfg:DocumentRef.КорпоративноеДействие_Новый</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КДРеференс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеньВыборки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКорпоративныхДействий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособУведомления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыУведомления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаФиксации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСообщенияИсходный</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтапКД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыКД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/ЭтапыКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЭтапыКД</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КодОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСообщенияИсходный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исходящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипУведомления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыУведомления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтапКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыКД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БПОбработкиWTRCСообщения</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.ОбработкаWTRCСообщения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозможноФормированиеУведомленияКлиентам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КД</Name>
					<Comment>(Карточка КД)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.РаскрытиеСпискаВладельцев</v8:Type>
						<v8:Type>cfg:DocumentRef.КорпоративноеДействие_Новый</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеКлиентам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументКД</Name>
					<Comment>(связанный документ по карточке КД)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.РаскрытиеСпискаВладельцев</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.КорпоративноеДействие_Новый</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/СпособыУведомления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыУведомления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сайт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныйКабинет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУведомлять</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/DataProcessors/ФиксацияКорпоративныхДействийВСообщенияхКД/Ext/ObjectModule.bsl
// Загружает в таблицу сообщения
Процедура ПолучитьДанные(Знач НачалоПериода, Знач КонецПериода) Экспорт
	НачалоПериода = НачалоДня(НачалоПериода);
	КонецПериода = КонецДня(КонецПериода);
	
	// Добавить новые сообщения с этапом УведомлениеКлиентов
	СпособыУведомления = Новый Массив;
	СпособыУведомления.Добавить(Перечисления.СпособыУведомления.Сайт);
	СпособыУведомления.Добавить(Перечисления.СпособыУведомления.ЛичныйКабинет);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("СпособыУведомления", СпособыУведомления);
	Запрос.Текст =
	"//////////////////////////////////////////////////////////////////////
	|// Свернуть сообщения по КД, по этапам и по дням.
	|// Получить ПериодНомераСообщенияИсходного, по которому определяется запись для получения НомерСообщенияИсходный.
	|ВЫБРАТЬ
	|	ЭтапыКД.КД КАК КД,
	|	ЭтапыКД.ЭтапКД КАК ЭтапКД,
	|	МАКСИМУМ(ЭтапыКД.Период) КАК ПериодНомераСообщенияИсходного
	|ПОМЕСТИТЬ ВТ_ЭтапыКД
	|ИЗ
	|	РегистрСведений.ЭтапыКД КАК ЭтапыКД
	|ГДЕ
	|	ЭтапыКД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ЭтапыКД.Исходящее
	|	И ЭтапыКД.КД.СчетДЕПО <> ЗНАЧЕНИЕ(Справочник.СчетаДепоМХ.ПустаяСсылка)
	|	И ЭтапыКД.ЭтапКД.ФормироватьУведомление
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭтапыКД.КД,
	|	ЭтапыКД.ЭтапКД,
	|	НАЧАЛОПЕРИОДА(ЭтапыКД.Период, ДЕНЬ)
	|;
	|
	|//////////////////////////////////////////////////////////////////////
	|// Получить вид КД и НомерСообщенияИсходного
	|ВЫБРАТЬ
	|	ВТ_ЭтапыКД.КД,
	|	ВТ_ЭтапыКД.ПериодНомераСообщенияИсходного КАК ПериодНомераСообщенияИсходного,
	|	НАЧАЛОПЕРИОДА(ВТ_ЭтапыКД.ПериодНомераСообщенияИсходного, ДЕНЬ) КАК ДеньВыборки,
	|	ВЫБОР
	|		КОГДА ВТ_ЭтапыКД.КД ССЫЛКА Документ.КорпоративноеДействие_Новый
	|			ТОГДА ВТ_ЭтапыКД.КД.ВидКД
	|		КОГДА ВТ_ЭтапыКД.КД ССЫЛКА Документ.РаскрытиеСпискаВладельцев
	|			ТОГДА ВТ_ЭтапыКД.КД.ВидКорпоративногоДействия
	|	КОНЕЦ КАК ВидКД,
	|	ЭтапыКДИсходныеНомера.НомерСообщенияИсходный КАК НомерСообщенияИсходный,
	|	ЭтапыКДИсходныеНомера.ЭтапКД КАК ЭтапКД
	|ПОМЕСТИТЬ ВТ_ВидКД
	|ИЗ
	|	ВТ_ЭтапыКД КАК ВТ_ЭтапыКД
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|	(ВЫБРАТЬ
	|		ЭтапыКД.Период КАК Период,
	|		ЭтапыКД.КД КАК КД,
	|		МАКСИМУМ(ЭтапыКД.НомерСообщенияИсходный) КАК НомерСообщенияИсходный,
	|		МАКСИМУМ(ЭтапыКД.ЭтапКД) КАК ЭтапКД
	|	ИЗ
	|		РегистрСведений.ЭтапыКД КАК ЭтапыКД
	|	ГДЕ
	|		ЭтапыКД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И ЭтапыКД.НомерСообщенияИсходный <> """"
	|		И НЕ ЭтапыКД.Исходящее
	|	СГРУППИРОВАТЬ ПО
	|		ЭтапыКД.Период,
	|		ЭтапыКД.КД
	|	) КАК ЭтапыКДИсходныеНомера
	|   ПО
	|		ВТ_ЭтапыКД.КД = ЭтапыКДИсходныеНомера.КД
	|		И ВТ_ЭтапыКД.ПериодНомераСообщенияИсходного = ЭтапыКДИсходныеНомера.Период
	|;
	|
	|//////////////////////////////////////////////////////////////////////
	|// Получить из КД дополнительные поля. Отбор по способам уведомления.
	|ВЫБРАТЬ
	|	ВТ_ВидКД.КД КАК КД,
	|	ВТ_ВидКД.КД.КДРеференс КАК КДРеференс,
	|	ВТ_ВидКД.ПериодНомераСообщенияИсходного КАК ПериодНомераСообщенияИсходного,
	|	ВТ_ВидКД.ЭтапКД КАК ЭтапКД,
	|	ВТ_ВидКД.ДеньВыборки КАК ДеньВыборки,
	|	ВТ_ВидКД.ВидКД КАК ВидКД,
	|	ВТ_ВидКД.ВидКД.СпособУведомления КАК СпособУведомления,
	|	ВТ_ВидКД.КД.ДатаФиксации КАК ДатаФиксации,
	|	ВТ_ВидКД.КД.ЦеннаяБумага1 КАК ЦеннаяБумага1,
	|	ВТ_ВидКД.КД.ЦеннаяБумага2 КАК ЦеннаяБумага2,
	|	ВТ_ВидКД.НомерСообщенияИсходный КАК НомерСообщенияИсходный
	|ИЗ
	|	ВТ_ВидКД КАК ВТ_ВидКД
	|ГДЕ
	|	ВТ_ВидКД.ВидКД.СпособУведомления В (&СпособыУведомления)
	|УПОРЯДОЧИТЬ ПО
	|	ПериодНомераСообщенияИсходного,
	|	ВТ_ВидКД.КД.Номер
	|";
	Результат = Запрос.Выполнить();
	
	ВходящиеСообщения.Очистить();
	ВходящиеСообщения.Загрузить(Результат.Выгрузить());
КонецПроцедуры

// Записывает в регистр ЭтапыКД сообщения из таблицы
Процедура ЗафиксироватьСообщенияКД(Знач НачалоПериода, Знач КонецПериода, ВремяЗаписи) Экспорт
	НачалоПериода = НачалоДня(НачалоПериода);
	КонецПериода = КонецДня(КонецПериода);
	
	// Удалить старые сообщения с этапом УведомлениеКлиентов
	УдалитьСообщенияСЭтапомУведомлениеКлиентов(НачалоПериода, КонецПериода);
	
	// Добавить новые сообщения с этапом УведомлениеКлиентов
	Если ВходящиеСообщения.Количество() = 0 Тогда
    	ТекстСообщения = "Не обнаружены данные за " + ПредставлениеПериода(НачалоПериода, КонецПериода)
			+ " для заполнения регистра сведений 'Сообщения КД'";
	Иначе
		ТекущийДень = '00010101';
		Для Каждого СтрокаСообщений из ВходящиеСообщения Цикл
			Если ТекущийДень <> СтрокаСообщений.ДеньВыборки Тогда // Это новый день
				ТекущийДень = СтрокаСообщений.ДеньВыборки;
				ПериодЗаписи = Дата(Год(ТекущийДень), Месяц(ТекущийДень), День(ТекущийДень), Час(ВремяЗаписи),
					Минута(ВремяЗаписи), Секунда(ВремяЗаписи));
			КонецЕсли;
			
			// Период записи не должен выйти за пределы текущего дня
			Если ТекущийДень <> НачалоДня(ПериодЗаписи) Тогда
				ТекстСообщения = "Не удалось записать все сообщения в регистр ""Сообщения КД"" за "+ПредставлениеПериода(НачалоПериода, КонецПериода)+"
				|Не все сообщения поместились в интервал времени с "+Формат(ВремяЗаписи, "ДФ=ЧЧ:мм:сс")+" до конца дня.";
				ЗаписьЖурналаРегистрации("Уведомления по КД", УровеньЖурналаРегистрации.Предупреждение,,, ТекстСообщения);
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = ТекстСообщения;
				Сообщение.Сообщить();
				Возврат;			
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.ЭтапыКД.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Установить(ПериодЗаписи);
			НаборЗаписей.Отбор.КД.Установить(СтрокаСообщений.КД);
			НаборЗаписей.Прочитать();
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Период = ПериодЗаписи;
			НоваяЗапись.КД = СтрокаСообщений.КД;
			НоваяЗапись.КодОтчета = "";
			НоваяЗапись.НомерСообщения = "";
			НоваяЗапись.НомерСообщенияИсходный = СтрокаСообщений.НомерСообщенияИсходный;
			НоваяЗапись.Исходящее = Истина;
			НоваяЗапись.ТипУведомления = Справочники.ТипыУведомления.NEWM();
			НоваяЗапись.ЭтапКД = Справочники.ЭтапыКД.УведомлениеКлиентов;
			НаборЗаписей.Записать();
			
			Если СтрокаСообщений.СпособУведомления = Перечисления.СпособыУведомления.ЛичныйКабинет Тогда
				// Зафиксировать список клиентов, кому было отправлено уведомление
				Клиенты = РегистрыСведений.УведомленияОтправленныеЧерезЛичныйКабинет.КлиентыИмеющиеЦенныеБумаги(
					Мин(НачалоДня(ТекущийДень), НачалоДня(СтрокаСообщений.ДатаФиксации)),
					СтрокаСообщений.ЦеннаяБумага1, СтрокаСообщений.ЦеннаяБумага2, СтрокаСообщений.КД.СчетДЕПО);
					
				РегистрыСведений.УведомленияОтправленныеЧерезЛичныйКабинет.ЗафиксироватьУведомления(ПериодЗаписи,
					СтрокаСообщений.КД, Клиенты);
			КонецЕсли;
			ПериодЗаписи = ПериодЗаписи + 60;
		КонецЦикла;
		ТекстСообщения = "Сообщения за " + ПредставлениеПериода(НачалоПериода, КонецПериода)
			+ " внесены в регистр сведений 'Сообщения КД'";
	КонецЕсли;
	ЗаписьЖурналаРегистрации("Уведомления по КД", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();
КонецПроцедуры

// Удалить сообщения с этапом УведомлениеКлиентов
Процедура УдалитьСообщенияСЭтапомУведомлениеКлиентов(НачалоПериода, КонецПериода)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("УведомлениеКлиентов", Справочники.ЭтапыКД.УведомлениеКлиентов);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЭтапыКД.Период
	|ИЗ
	|	РегистрСведений.ЭтапыКД КАК ЭтапыКД
	|ГДЕ
	|	ЭтапыКД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ЭтапыКД.ЭтапКД = &УведомлениеКлиентов
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтапыКД.Период";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ЭтапыКД.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		НаборЗаписей.Прочитать();
		Индекс = 0;
		Пока Индекс < НаборЗаписей.Количество()  Цикл
			Если НаборЗаписей[Индекс].ЭтапКД = Справочники.ЭтапыКД.УведомлениеКлиентов Тогда
				НаборЗаписей.Удалить(Индекс);
			Иначе
				Индекс = Индекс + 1;
			КонецЕсли;
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЦикла;
КонецПроцедуры

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
